Repository: rawa7/rocfit
Catalog: lib/l10n/app_*.arb
Languages: fa

# appName
source: RocFit
fa: ڕۆک فیت

source: Welcome
fa: بەخێربێیت

source: Login
fa: چوونە ژوورەوە

source: Username
fa: ناوی بەکارهێنەر

source: Password
fa: وشەی تێپەڕ

source: Continue as Guest
fa: وەک میوان بەردەوام بە

source: Profile
fa: پڕۆفایل

source: Home
fa: سەرەکی

source: Exercise
fa: ڕاهێنان

source: Calculator
fa: ژمێرەر

source: Feedback
fa: پێشنیار

source: Notifications
fa: ئاگادارکردنەوەکان

source: SHOP
fa: فرۆشگا

source: MEAL PLAN
fa: پلانی خواردن

source: Your Progress
fa: پێشکەوتنت

source: Workouts
fa: ڕاهێنانەکان

source: Days Trained
fa: ڕۆژانی ڕاهێنان

source: Points
fa: خاڵەکان

source: Membership Status
fa: دۆخی ئەندامەتی

source: ACTIVE
fa: چالاک

source: EXPIRED
fa: بەسەرچووە

source: Start Date
fa: ڕێکەوتی دەستپێک

source: End Date
fa: ڕێکەوتی کۆتایی

# daysRemaining
source: {count} days remaining
fa: {count} ڕۆژ ماوە

source: Membership expired
fa: ئەندامەتی بەسەرچووە

source: Quick Actions
fa: کردارە خێراکان

source: Workout
fa: ڕاهێنان

source: Meals
fa: خواردنەکان

source: Progress
fa: پێشکەوتن

source: More Options
fa: بژاردەی زیاتر

# manageNotifications
source: Manage your notifications
fa: بەڕێوەبردنی ئاگادارکردنەوەکان

# browseProducts
source: Browse our products
fa: گەڕان بە بەرهەمەکانمان

# shareThoughts
source: Share your thoughts with us
fa: بیرۆکەکانت لەگەڵ ئێمە هاوبەش بکە

source: Logout
fa: دەرچوون

source: Exit Guest Mode
fa: دەرچوون لە دۆخی میوان

# logoutConfirm
source: Logout?
fa: دەرچوون؟

# exitGuestConfirm
source: Exit Guest Mode?
fa: دەرچوون لە دۆخی میوان؟

# logoutMessage
source: Are you sure you want to logout?
fa: دڵنیایت لە دەرچوون؟

# exitGuestMessage
source: Are you sure you want to exit guest mode?
fa: دڵنیایت لە دەرچوون لە دۆخی میوان؟

source: Cancel
fa: هەڵوەشاندنەوە

source: Exit
fa: دەرچوون

source: Coming soon!
fa: بەزووە دێت!

# trackProgress
source: Track Your Progress
fa: پێشکەوتنت بشوێنە

# signUpMessage
source: Sign up to track workouts, view stats, and see your fitness journey!
fa: تۆمار بکە بۆ شوێنکەوتنی ڕاهێنان و بینینی ئامارەکان و ڕێگای تەندروستیت!

source: Loading...
fa: بارکردن...

source: Loading profile...
fa: بارکردنی پڕۆفایل...

source: Failed to load profile
fa: سەرکەوتوو نەبوو لە بارکردنی پڕۆفایل

source: Retry
fa: دووبارە هەوڵدانەوە

source: User not logged in
fa: بەکارهێنەر نەچووەتە ژوورەوە

source: Guest User
fa: بەکارهێنەری میوان

source: Member
fa: ئەندام

source: Settings
fa: ڕێکخستنەکان

source: Language
fa: زمان

source: Select Language
fa: زمان هەڵبژێرە

# dayWorkout
source: Day {day} Workout
fa: ڕاهێنانی ڕۆژی {day}

source: exercises
fa: ڕاهێنانەکان

source: Loading exercises...
fa: بارکردنی ڕاهێنانەکان...

# participationEnded
source: Participation Period Ended
fa: ماوەی بەشداری کۆتایی هات

source: Participation Details
fa: وردەکاری بەشداری

source: Period
fa: ماوە

source: Check Again
fa: دووبارە بپشکنە

source: Refresh
fa: نوێکردنەوە

source: Start Workout
fa: دەستکردن بە ڕاهێنان

source: Complete
fa: تەواو

source: {exercise} completed!
fa: {exercise} تەواو بوو!

# pleaseLoginToStart
source: Please login to start workout
fa: تکایە بچۆرە ژوورەوە بۆ دەستکردن بە ڕاهێنان

# pleaseLoginToComplete
source: Please login to complete exercises
fa: تکایە بچۆرە ژوورەوە بۆ تەواوکردنی ڕاهێنانەکان

# noWorkoutData
source: No workout data available
fa: هیچ زانیاریەکی ڕاهێنان بەردەست نییە

# continueAsGuestButton
source: Continue as Guest
fa: وەک میوان بەردەوام بە

source: Loading foods...
fa: بارکردنی خواردنەکان...

# noFoodsForMeal
source: No foods for this meal
fa: هیچ خواردنێک نییە بۆ ئەم ژەمە

source: {food} completed!
fa: {food} تەواو بوو!

source: Breakfast
fa: بەیانی خوان

source: Lunch
fa: نیوەڕۆ خوان

source: Dinner
fa: ئێواره خوان

source: Workout available
fa: ڕاهێنان بەردەستە

source: BMI Calculator
fa: ژمێرەری BMI

# bmiCalculatorTitle
source: BMI CALCULATOR
fa: ژمێرەری BMI

source: Units:
fa: یەکە:

# metricUnits
source: Metric (cm, kg)
fa: مەتری (سم، کیلۆ)

# imperialUnits
source: Imperial (ft, lbs)
fa: ئیمپراتۆری (پێ، پاوند)

source: Metric
fa: مەتری

source: Imperial
fa: ئیمپراتۆری

source: Height (cm)
fa: درێژی (سم)

source: Height (ft)
fa: درێژی (پێ)

# heightHintCm
source: e.g., 175
fa: وەک: 175

# heightHintFt
source: e.g., 5.8
fa: وەک: 5.8

source: Weight (kg)
fa: کێش (کیلۆ)

source: Weight (lbs)
fa: کێش (پاوند)

# weightHintKg
source: e.g., 70
fa: وەک: 70

# weightHintLbs
source: e.g., 154
fa: وەک: 154

source: Calculate BMI
fa: ژمێردنی BMI

source: Clear
fa: پاککردنەوە

source: Your BMI Result
fa: ئەنجامی BMI ت

source: BMI Categories
fa: جۆرەکانی BMI

source: Underweight
fa: کەمی کێش

source: Normal weight
fa: کێشی ئاسایی

source: Overweight
fa: زیادەی کێش

source: Obese
fa: قەڵەوی

# pleaseEnterHeight
source: Please enter your height
fa: تکایە درێژیت بنووسە

# pleaseEnterValidHeight
source: Please enter a valid height
fa: تکایە درێژییەکی دروست بنووسە

# heightRangeCm
source: Height should be between 50-300 cm
fa: درێژی دەبێت نێوان 50-300 سم بێت

# heightRangeFt
source: Height should be between 1-10 feet
fa: درێژی دەبێت نێوان 1-10 پێ بێت

# pleaseEnterWeight
source: Please enter your weight
fa: تکایە کێشت بنووسە

# pleaseEnterValidWeight
source: Please enter a valid weight
fa: تکایە کێشێکی دروست بنووسە

# weightRangeKg
source: Weight should be between 20-500 kg
fa: کێش دەبێت نێوان 20-500 کیلۆ بێت

# weightRangeLbs
source: Weight should be between 44-1100 lbs
fa: کێش دەبێت نێوان 44-1100 پاوند بێت

# feedbackTitle
source: FEEDBACK
fa: پێشنیار

source: RATE
fa: هەڵسەنگاندن

# feedbackPlaceholder
source: TYPE YOUR FEEDBACK HERE ...
fa: پێشنیارەکانت لێرە بنووسە ...

source: Submit
fa: ناردن

# pleaseEnterFeedback
source: Please enter your feedback
fa: تکایە پێشنیارەکانت بنووسە

source: Please login to submit feedback
fa: تکایە بچۆرە ژوورەوە بۆ ناردنی پێشنیار

source: Error
fa: هەڵە

source: Hello
fa: سڵاو

# homeStartDate
source: START DATE
fa: ڕێکەوتی دەستپێک

# homeExpireDate
source: EXPIRE DATE
fa: ڕێکەوتی کۆتایی

source: SUPPLEMENT
fa: خۆراکی پێکەری

source: FOOD MENU
fa: لیستی خواردن

source: Image
fa: وێنە

source: No banner images available
fa: هیچ وێنەیەکی بانەر بەردەست نییە

source: No workout items available
fa: هیچ بابەتێکی ڕاهێنان بەردەست نییە

source: star
fa: ئەستێرە

source: Tap to view details
fa: دەستی لێبدە بۆ بینینی وردەکاری

source: Loading menu items...
fa: بارکردنی بابەتەکانی لیست...

source: Failed to load menu items
fa: سەرکەوتوو نەبوو لە بارکردنی بابەتەکانی لیست

source: Please try again.
fa: تکایە دووبارە هەوڵبدەوە.

source: All
fa: هەموو

# noItemsFound
source: No {itemType} items found
fa: هیچ بابەتێکی {itemType} نەدۆزرایەوە

# inCategory
source: in {category} category
fa: لە جۆری {category}

source: No Image Available
fa: هیچ وێنەیەک بەردەست نییە

source: Loading image...
fa: بارکردنی وێنە...

source: Unable to load image
fa: نەتوانرا وێنە بار بکرێت

source: Price:
fa: نرخ:

source: Description
fa: وەسف

# noDescriptionAvailable
source: No description available for this item.
fa: هیچ وەسفێک نییە بۆ ئەم بابەتە.

source: Food
fa: خواردن

# suppliment
source: Supplement
fa: خۆراکی پێکەری

# mealPlanTitle
source: MEAL PLAN
fa: پلانی خواردن

source: Tap to view meal image
fa: دەستی لێبدە بۆ بینینی وێنەی خواردن

source: foods
fa: خواردنەکان

# serving
source: Serving: {amount}
fa: بەش: {amount}

source: Failed to load meal plan
fa: سەرکەوتوو نەبوو لە بارکردنی پلانی خواردن

source: Failed to load foods
fa: سەرکەوتوو نەبوو لە بارکردنی خواردنەکان

# pinchToZoom
source: Pinch to zoom • Tap outside to close
fa: پەنجە بکە بۆ گەورەکردن • دەرەوە دەست بدە بۆ داخستن

source: Tap outside to close
fa: دەرەوە دەست بدە بۆ داخستن
